In [1]:
import numpy as np 
import pandas as pd

In [2]:
from datetime import datetime

In [3]:
myyear = 2015
mymonth = 1
myday = 1
myhr = 2
mymin = 30
mysec = 15

In [5]:
mydate = datetime(myyear, mymonth, myday)

In [6]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [7]:
mydate.year

2015

In [10]:
mydate.month

1

In [11]:
mydate.day

1

In [12]:
mydatetime = datetime(myyear, mymonth, myday, myhr, mymin, mysec)

In [13]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [14]:
mydatetime.hour

2

In [15]:
mydatetime.minute

30

In [16]:
mydatetime.second

15

# Working with date and time using the pandas

In [18]:
myser = pd.Series(['Nov 3, 1990', '2000-01-01', None])
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [21]:
timeser = pd.to_datetime(myser)

In [22]:
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [23]:
euro_date = '10-12-2000' # dec 10 2000

In [25]:
pd.to_datetime(euro_date) # So here we can see that the pandas make the date as OCT 12 2000

Timestamp('2000-10-12 00:00:00')

In [27]:
pd.to_datetime(euro_date, dayfirst=True) # Now we have resolve our problem using the dayfirst parameter

Timestamp('2000-12-10 00:00:00')

In [28]:
df = pd.read_csv('RetailSales_BeerWineLiquor.csv')
df

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [30]:
df['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [32]:
df['DATE'] = pd.to_datetime(df['DATE'])

In [33]:
df['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [34]:
df = pd.read_csv('RetailSales_BeerWineLiquor.csv')
df

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [35]:
df['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [37]:
df = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [38]:
df['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [39]:
df['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64